---
kind: other
id: Methods.T:Autodesk.Revit.DB.SelectionFilterElement
source: html/69b6a234-3cec-cc76-ae7c-972eb55045e2.htm
---
# SelectionFilterElement Methods

Adds a set of ElementIds to the filter's set.